src/test/resources/io/2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:soap:functions:mc-style">
    <soapenv:Header/>
    <soapenv:Body>
        <urn:ZmdmMas001>
            <!--Optional:-->
            <PTb>X</PTb>
            <!--Optional:-->
            <PXs>X</PXs>
            <!--Optional:-->
            <PaMfTh></PaMfTh>
            <!--Optional:-->
            <SErdat>
                <!--Zero or more repetitions:-->
                <item>
                    <Sign>I</Sign>
                    <Option>BT</Option>
                    <Low>20191101</Low>
                    <High>20191105</High>
                </item>
            </SErdat>
            <!--Optional:-->
            <SVkorg>
                <!--Zero or more repetitions:-->
                <item>
                    <Sign>I</Sign>
                    <Option>BT</Option>
                    <Low>1000</Low>
                    <High>5999</High>
                </item>
            </SVkorg>
        </urn:ZmdmMas001>
    </soapenv:Body>
</soapenv:Envelope>